src/Documents/фуКадровоеИзменение/фуКадровоеИзменение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>фуКадровоеИзменение</name>
  <registerRecords>InformationRegister.фуКадроваяИсторияСотрудников</registerRecords>
  <attributes>
    <name>ВалютаВыплатыЗарплаты</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.фуГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКадровогоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.фуДепартамент</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.фуДолжности</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МотивационнаяСхема</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладОфициальный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкладУправленческий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.фуОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>CatalogRef.фуОтделы</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.фуСотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_Транзакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерРаботы</name>
    <type>
      <types>CatalogRef.фуХарактерРаботы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СканыДокументовКадры</name>
    <attributes>
      <name>СканДокумента</name>
      <type>
        <types>CatalogRef.фуСканыДокументовКадры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/фуКадровоеИзменение/Forms/ФормаДокумента/Module.bsl
#Область о // Стандартные процедуры и функции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
    фуОбщийСервер.УстановитьДоступоностьРеквизитовНаФорме(Элементы,Объект.Ссылка);    
	// +++ Чесноков М.С. 2021-09-16 F1-121
	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);
	// --- Чесноков М.С. 2021-09-16 F1-121
	
КонецПроцедуры    

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	// +++ Чесноков М.С. 2021-09-16 F1-121
	ЗагрузитьИсториюПоКадровымДаннымНаСервере(Объект.Сотрудник);
	ЗагрузитьДанныеПоСотрудникуНаСервере(Объект.Сотрудник);
	// --- Чесноков М.С. 2021-09-16 F1-121

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСканДокумента(Команда)
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	фуКадровыйУчетКлиент.ОткрытьФорму_фмСканыДокументовКадры(Объект,,);
	// --- Чесноков М.С. 2021-09-22 F1-121
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	Если ИмяСобытия = "ЗакрытиеФормыПриДобавленииНовогоСканаДокумента"  Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ДобавитьСтрокуВТЧНаСервере(Параметр);
		КонецЕсли; 
		
	КонецЕсли; 
	// --- Чесноков М.С. 2021-09-22 F1-121

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуВТЧНаСервере(Параметр)
	
	НоваяСтрока = Объект.СканыДокументовКадры.Добавить();
	НоваяСтрока.СканДокумента = Параметр;
	
КонецПроцедуры

&НаКлиенте
Процедура СканыДокументовКадрыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// +++ Чесноков М.С. 2021-09-22 F1-121
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.СканДокумента) Тогда
		
		фуКадровыйУчетКлиент.ОткрытьФорму_фмСканыДокументовКадры(Объект,Элемент.ТекущиеДанные.СканДокумента);
		
	КонецЕсли; 
	// --- Чесноков М.С. 2021-09-22 F1-121 

КонецПроцедуры

#КонецОбласти 
 
#Область о // Загрузка кадровых данных

// +++ Чесноков М.С. 2021-09-16 F1-121
Процедура ЗагрузитьДанныеПоСотрудникуНаСервере(СотрудникСсылка)
	
	Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
		Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(Объект.ДатаКадровогоИзменения) Тогда
		МоментВремени = НачалоДня(Объект.ДатаКадровогоИзменения)-1;
	Иначе
		МоментВремени = ТекущаяДата();
	КонецЕсли;	
	
	ДанныеПоСотруднику = фуКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудника(СотрудникСсылка,МоментВремени); 
	ЗаполнитьЗначенияСвойств(Объект,ДанныеПоСотруднику);
	
КонецПроцедуры
// --- Чесноков М.С. 2021-09-16 F1-121

// +++ Чесноков М.С. 2021-09-16 F1-121
Процедура ЗагрузитьИсториюПоКадровымДаннымНаСервере(СотрудникСсылка)
	
	Если Не ЗначениеЗаполнено(СотрудникСсылка) Тогда
		Возврат;
	КонецЕсли; 

	Если ЗначениеЗаполнено(Объект.ДатаКадровогоИзменения) Тогда
		МоментВремени = НачалоДня(Объект.ДатаКадровогоИзменения)-1;
	Иначе
		МоментВремени = ТекущаяДата();
	КонецЕсли;	
	
	ДанныеПоСотруднику = фуКадровыйУчетСервер.ПолучитьКадровыеДанныеСотрудника(СотрудникСсылка,МоментВремени); 
	
	// +++ Чесноков М.С. 2022-01-28 F1-183
	Для каждого ЭлементСтруктуры Из ДанныеПоСотруднику Цикл
		
		ИмяРеквизитаФормы = "мИстория"+ЭлементСтруктуры.Ключ;
		Если фуОбщийКлиентСервер.ЕстьСвойство(ЭтаФорма,ИмяРеквизитаФормы) Тогда
			ЭтаФорма[ИмяРеквизитаФормы] = ЭлементСтруктуры.Значение;	
		КонецЕсли;
				
	КонецЦикла;
	// --- Чесноков М.С. 2022-01-28 F1-183

	// +++ Чесноков М.С. 2021-11-30 F1-152
	Если ДанныеПоСотруднику.Свойство("ОкладОфициальный") Тогда
		мИсторияОкладОфициальный        = ДанныеПоСотруднику.ОкладОфициальный;	
	КонецЕсли; 
	Если ДанныеПоСотруднику.Свойство("ОкладУправленческий") Тогда
		мИсторияОкладУправленческий     = ДанныеПоСотруднику.ОкладУправленческий;	
	КонецЕсли; 
	// --- Чесноков М.С. 2021-11-30 F1-152 
	
КонецПроцедуры
// --- Чесноков М.С. 2021-09-16 F1-121 

#КонецОбласти
